Docs/perfil.tex
\begin{titlepage}
\begin{center}
\vspace{2cm}
{\Large UNIVERSIDAD CATÓLICA BOLIVIANA "SAN PABLO" UNIDAD ACADÉMICA REGIONAL LA PAZ \par}
{\Medium FACULTAD DE INGENIERÍA \par}
CARRERA DE INGENIERÍA MECATRÓNICA \par

\vspace{2cm}
logo \par
\vspace{2cm}
{\Large DIYBAS: DO IT YOURSELF BIO-SIGNAL ADQUISITION SYSTEM \par}
\vspace{1cm}
{\large Proyecto de grado presentado para la optención del Grado de Ingeniería Mecatrónica \par}
\vspace{1cm}
Por: RODRIGO SEBASTIAN MENDOZA TEJADA \par
\vspace{1.5cm}


\vfill
La Paz-- Bolivia//
Diciembre, 2018
\end{titlepage}

\section{Final}
\label{sec:orgd8b67db}
\subsection{Introducción}
\label{sec:orgc95a141}
La practica de medir bioseñales consiste en medir los distintos impulsos eléctricos que pueda producir un ser vivo. Dichos impulsos eléctricos provienen de las señales eléctricas que utilizan los músculos para sus contracciones a excepción de las señales eléctricas producidas por el cerebro. Dentro de las señales más comunes son las provenientes del sistema cardiaco (ECG), movimiento intraocular (EOG), impulsos mioeléctricos o impulsos musculares (EMG) impulsos electro encefalográficos o impulsos cerebrales (EEG). La utilidad de medir las bioseñales se pueden ver desde un ámbito médico de diagnóstico y monitoreo como el monitoreo de presencia de actividad cerebral en pacientes en coma [ACNS 2016], o como el monitoreo de signos vitales (respiración, ritmo cardiaco) en pacientes internados. En un ámbito menos crítico se puede observar en la asistencia en actividades comunes (ejercicio, entrenamiento físico, dormir, rehabilitación motora, etc.).

Todas las bioseñales tienen características en común lo cual significa que se pueden utilizar métodos similares para la medición de todas las señales; todas las bioseñales pueden ser medidas por medio de electrodos colocados sobre la superficie de piel más cercana a la fuente de origen. Todas presentan grandes niveles de ruido provenientes de varias fuentes como la estática almacenada en la superficie de la piel y pelo, así como la interferencia de otra bioseñal. Por este motivo, las bioseñales son muy difíciles de aislar por lo cual un método común de hacerlo es por el uso de amplificadores diferenciales [Winter, B. 1983a]. Sin embargo podemos observar que de todas estas, la que pre\senta mayores dificultades es la EEG ya que la magnitud de la señal es mucho menor a el resto causando que la relación señal-ruido (SNR) sea muy baja. Una observación importante entonces, es que un dispositivo que sea capaz de medir actividad cerebral, podrá medir el resto de las bioseñales con una reducción en la magnitud de amplificación de señal que debe presentar y un reposicionamiento y cambio del tipo de electrodos[Mathewson, Kyle E. 2017][Lopez-Gordo, M. 2014][Fiedler, Pa. 2014].

Con el avance de la tecnología, esta rama se expandió al medio de la computación en el cual se utilizan las señales EEG como la entrada de interfaces en distintos tipos de sistemas. Las Interfaces Cerebro-Computador (BCI, Brain-Computer Interface) asocian la actividad eléctrica por los patrones que presenta con intenciones del usuario. Las interfaces se pueden catalogar según la cantidad de opciones de categorización; por ejemplo, un sistema BCI de clase 2 reconoce actividad cerebral motora (MI - Motor Imagery) mano izquierda y MIB de pie/mano derechos [Gandhi, V. 2014]. La actividad cerebral ocurre en distintos lugares del cerebro simultáneamente. Es por este motivo que la cantidad de electrodos y la disposición con la que son utilizados influencian en el resultado que se pueda obtener según el caso de uso[Jurcak, V. 2007]. Esto se debe en gran parte a los artefactos (interferencias de otras bioseñales) que se puedan presentar. Además, mientras mayor cantidad de electrodos se utilizan, resulta más fácil de aislar las fuentes y por consecuencia, las mismas señales entre sí. Por ejemplo, en el caso de las polisomnografías (PSG) o estudios del sueño, el método de utilizar 18 o más electrodos resulta de gran beneficio [Bubrick, El. 2014]. Debido a este incremento de desempeño, los estándares presentados por la IFCN (Federación Internacional de Neurofisiología Clínica) [1999a] y la ACNS (Sociedad Americana de Neurofisiología Clínica)[2016] para realizar mediciones EEG indican que se debe hacer el uso mínimo de 24 electrodos, sin embargo los estándares permiten la utilización hasta de 329 electrodos [Oostenveld and Praamstra, 2001].
\subsection{Planteamiento del problema}
\label{sec:orgde4aeaa}
La EEG es una practica relativamente nueva siendo [Jasper 1958]  presentando por primera vez el estándar para la colocación de electrodos para la realización de mediciones EEG. Si bien la tecnología en general ha avanzado exponencialmente desde ese entonces, la EEG se encuentra sub-desarrollada en comparación a las otras bioseñales. Existen causas inherentes a la naturaleza de la señal así como causas practicas. 

La tarea de medir ondas cerebrales es particularmente difícil ya que las señales pueden ser tan bajas como los 20µV por lo cual se requiere una precisión hasta de 0.5µV y el ruido no debe pasar 1.5µV [IFCN 1999b]. Pero la principal dificultad de realizar estas mediciones es que el ruido que puede llegar a estar a magnitudes de 1000 veces más grandes que la señal original. Este ruido puede venir inclusive de otras bioseñales como el EOG, es por eso que se necesita una Taza de Rechazo de Nodo Común (CMMRR) alta, aproximadamente 120db[MettingVanRijn, A. 1994], a modo de combatir los artefactos en conjunto a un circuito DRL (Driven Right-Leg) que es esencial en sistemas de adquisición de bioseñales de cualquier tipo[Winter, B 1983b].

La naturaleza compleja de realizar EEG causa que los dispositivos que cuenten con la  precisa y con una alta densidad de canales sean de un acceso muy limitado debido al costo, disponibilidad local y soporte. También se puede mencionar que debido a la poca variedad causan que el costo no pueda ser reducido al seleccionar cuidadosamente un dispositivo para una aplicación específica. Por otro lado los dispositivos que son mas potentes tienden a ser menos configurares y con una compatibilidad más limitada en software y hardware. Además, los dispositivos cuentan con el hardware necesario para poder medir otros tipos de bioseñales, sin embargo pocos dispositivos implementan la flexibilidad necesaria para poder realizar estas mediciones. Esta falta de flexibilidad en los dispositivos mas potentes se observa en el firmware, software, el manejo de datos y en el hardware.

\subsection{Taxonomía de soluciones previas}
\label{sec:orgd686578}
Existen varios dispositivos comerciales como los productos de EMOTIV y también OpenBCI. Sin embargo estos productos son bastante caros y con capacidades limitadas. Estos dispositivos ofrecen hasta 14 canales de electrodos en el rango de dispositivos menor a 1’000USD. dejando así muy lejos de los mínimos 24 y mucho mas de los deseados 32 [IFCN 1999c]. Además, mientras mas competentes son los dispositivos, son mas limitados en otros aspectos. Principalmente en la información disponible y las flexibilidades que te presenta.

Por ejemplo podemos mencionar el proyecto ModularEEG, presenta grandes flexibilidades y muchos foros de ayuda, sin embargo el diseño apenas cumple con la misión de observar señales de EEG. En el caso del OpenBCI, si bien es diseño de código abierto, su utilidad práctica en la flexibilidad electrónica es muy limitada. Eso sin mencionar el elevado costo para la persona común que solamente puede obtener 8 canales. En el caso de EMOTIV podemos mencionar su producto EPOC que con un valor mayor provee 14 canales con una interfaz muy limitada y sujeto a licencias que aumentan el costo. Este es el menos modificable de los 3 dispositivos.


\subsection{Justificación}
\label{sec:org49aa1b1}
\begin{center}
\begin{tabular}{lllll}
 & Open BCI & EMOTIV EPOC & Modular EEG & Ref. Papers\\
\hline
Costo (USD) &  &  &  & \\
 &  &  &  & \\
 &  &  &  & \\
 &  &  &  & \\
 &  &  &  & \\
 &  &  &  & \\
\end{tabular}
\end{center}

\subsection{Límites y Alcances}
\label{sec:orgd89f3d1}
\subsection{Bibliografía}
\label{sec:org8e701a0}
\subsection{Sugerencia de Profesor tutor (debe contar con al menos 3 opciones quienes firmaron en la portada de perfil).}
\label{sec:org2103055}
